In [5]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np 
import seaborn as sns

In [6]:
data = pd.read_csv('nba.csv')

In [10]:
data.corr(numeric_only=True, method='pearson')

          Number       Age    Weight    Salary
Number  1.000000  0.028724  0.206921 -0.112386
Age     0.028724  1.000000  0.087183  0.213459
Weight  0.206921  0.087183  1.000000  0.138321
Salary -0.112386  0.213459  0.138321  1.000000

In [11]:
data.corr(numeric_only=True, method='kendall')

          Number       Age    Weight    Salary
Number  1.000000  0.005536  0.155850 -0.075301
Age     0.005536  1.000000  0.066130  0.172616
Weight  0.155850  0.066130  1.000000  0.087165
Salary -0.075301  0.172616  0.087165  1.000000

In [13]:
customer_df = pd.read_csv('customers.csv')
customer_df

   CustomerID   CustomerName Region                Email
0         101       John Doe  North     john@example.com
1         102     Jane Smith  South     jane@example.com
2         103    Bob Johnson   East      bob@example.com
3         104    Alice Brown   West    alice@example.com
4         105  Charlie Davis  North  charlie@example.com
5         106     Eva Wilson  South      eva@example.com
6         107   Frank Miller   East    frank@example.com
7         108      Grace Lee   West    grace@example.com

In [16]:
orders_df = pd.read_csv('orders.csv')
orders_df

   OrderID  CustomerID  OrderAmount   OrderDate
0     5001         101       150.00  2023-01-15
1     5002         103       200.50  2023-01-16
2     5003         102        75.25  2023-01-17
3     5004         105       300.00  2023-01-18
4     5005         101        50.00  2023-01-19
5     5006         104       120.75  2023-01-20
6     5007         108        90.00  2023-01-21
7     5008         102       180.00  2023-01-22
8     5009         106       250.00  2023-01-23
9     5010         109        60.00  2023-01-24

In [19]:
merged_data = pd.merge(orders_df,customer_df,on='CustomerID',how='left')

In [20]:
merged_data

,OrderID,CustomerID,OrderAmount,OrderDate,CustomerName,Region,Email
0,5001,101,150.00,2023-01-15,John Doe,North,john@example.com
1,5002,103,200.50,2023-01-16,Bob Johnson,East,bob@example.com
2,5003,102,75.25,2023-01-17,Jane Smith,South,jane@example.com
3,5004,105,300.00,2023-01-18,Charlie Davis,North,charlie@example.com
4,5005,101,50.00,2023-01-19,John Doe,North,john@example.com
5,5006,104,120.75,2023-01-20,Alice Brown,West,alice@example.com
6,5007,108,90.00,2023-01-21,Grace Lee,West,grace@example.com
7,5008,102,180.00,2023-01-22,Jane Smith,South,jane@example.com
8,5009,106,250.00,2023-01-23,Eva Wilson,South,eva@example.com
9,5010,109,60.00,2023-01-24,NaN,NaN,NaN